<?php
/**
 * $Id: CustomerImport.php 66 2014-10-07 09:24:39Z h.ushito@nicosys.jp $
 *
 * @copyright (c) 2014 Nicosys Co. Ltd.
 */

App::uses('AppModel', 'Model');

/**
 */
class CustomerImport extends AppModel {

	//----------------------------------------------------------------------
	// 動作設定
	//----------------------------------------------------------------------

	public $useTable = false;

	public $actsAs = [
		'Nicosys.FileValidatable'
	];

	//----------------------------------------------------------------------
	// 依存関係
	//----------------------------------------------------------------------

	//----------------------------------------------------------------------
	// 検証ルール
	//----------------------------------------------------------------------

	public $validate = [

		'file' => [
			'required' => [
				'rule'     => 'validateFile',
				'required' => true,
				'message'  => 'ファイルをアップロードしてください。',
			],
			'csv'      => [
				'rule'     => ['validateFileExtension', 'csv'],
				'required' => true,
				'message'  => 'CSV ファイルをアップロードしてください。',
			],
			'size'     => [
				'rule'     => ['validateFileSize', 8388608], // 8MB
				'required' => true,
				'message'  => 'アップロードできるのは 8MB までです。',
			],
		]

	];

	//----------------------------------------------------------------------
	// 選択項目
	//----------------------------------------------------------------------

	public $mapping = [
		'企業名'     => 'name',
		'郵便番号'    => 'zipcode',
		'住所'      => 'address',
		'業種'      => 'business',
		'TEL番号'   => 'phone',
		'FAX番号'   => 'fax',
		'URL'     => 'url',
		'メールアドレス' => 'email',
	];

	//----------------------------------------------------------------------
	// ロジック
	//----------------------------------------------------------------------

}
